bontango/FA_Control/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# Partition table: single factory app, larger to fit WiFi + HTTPD comfortably
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# WiFi: reduce buffers for a small footprint
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# LWIP
CONFIG_LWIP_MAX_SOCKETS=10
